# ClearFields Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..ClearFields Method
ScheduleDefinition Class See Also
---
Removes all fields.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void ClearFields()
```

Visual Basic
---
```text
Public Sub ClearFields
```

Visual C++
---
```text
public:
void ClearFields()
```

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace